app/Controllers/Arbitro.php

    public function index(): string
    {

        $arbitroM = model('ArbitroM');

        $data['arbitro'] = $arbitroM->findAll();
---
SELECT *
FROM `arbitro`