app/Controllers/Canchas.php

    public function index(): string
    {

        $canchaM = model('CanchaM');

        $data['canchas'] = $canchaM->findAll();
---
SELECT *
FROM `cancha`