app/Controllers/Entrenador.php

    public function index(): string
    {

        $entrenadorM = model('EntrenadorM');

        $data['entrenador'] = $entrenadorM->findAll();
---
SELECT *
FROM `entrenador`