app/Controllers/Equipo.php

SELECT *
FROM `equipo`
---
    public function index(): string
    {

        $equipoM = model('EquipoM');

        $data['equipo'] = $equipoM->findAll();