app/Controllers/Jugador.php

SELECT *
FROM `jugador`
---
    public function index(): string
    {

        $jugadorM = model('JugadorM');

        $data['jugador'] = $jugadorM->findAll();