app/Controllers/Partido.php

    public function index(): string
    {

        $partidoM = model('PartidoM');

        $data['partido'] = $partidoM->findAll();
---
SELECT *
FROM `partido`

    public function update(){
        $partidoM = model('PartidoM');
        $idpartido = $_POST['idpartido'];

            $data = [
                "idCancha" => $_POST['idCancha'] ,
                "idArbitro" => $_POST['idArbitro'] ,
                "horaInicio" => $_POST['horaInicio'] ,
                "idVisitante" => $_POST['idVisitante'] ,
                "idLocal" => $_POST['idLocal'] ,
                    ];

               $partidoM->set($data)->where('idpartido',$idpartido)->update();
---
UPDATE `partido` SET `idCancha` = '1 ', `idArbitro` = '1 ', `horaInicio` = '21:00', `idVisitante` = '1 ', `idLocal` = '1 '
WHERE `idpartido` = '1'